# running in vga_cov/src/
read_verilog -formal VGA_controller.v
prep -top VGA_controller
memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
