# running in FSM/src/
read_verilog -formal Bounce_Counter_FSM.v
prep -top Bounce_Counter_FSM


memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
